In [1]:
import numpy as np
import pandas as pd

In [2]:
d = {'A':[1,2,np.nan], 'B':[5,np.nan,np.nan], 'C':[1,2,3]}

In [3]:
df = pd.DataFrame(d)

In [4]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [5]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [6]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [7]:
df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [8]:
df.dropna(thresh = 2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [9]:
df.fillna(value = 5) # if you put inplace = True, this means value 5 will be permanently inserted into Dataframe.

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  5.0  5.0  3

In [10]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [11]:
df.fillna(value = df['A'].mean())

     A    B  C
0  1.0  5.0  1
1  2.0  1.5  2
2  1.5  1.5  3

In [12]:
import pandas as pd

# create example DataFrame with duplicated values
data = {'col1': [1, 2, 3, 3, 4, 5, 5], 'col2': ['a', 'b', 'c', 'c', 'd', 'e', 'e']}
df = pd.DataFrame(data)

# print original DataFrame
print("Original DataFrame:")
print(df)

# identify and print the duplicated rows
duplicates = df[df.duplicated()]
print("\nDuplicated rows:")
print(duplicates)

# remove duplicated rows and print the cleaned DataFrame
cleaned_df = df.drop_duplicates()
print("\nCleaned DataFrame:")
print(cleaned_df)

Original DataFrame:
   col1 col2
0     1    a
1     2    b
2     3    c
3     3    c
4     4    d
5     5    e
6     5    e

Duplicated rows:
   col1 col2
3     3    c
6     5    e

Cleaned DataFrame:
   col1 col2
0     1    a
1     2    b
2     3    c
4     4    d
5     5    e

In [13]:
# create example DataFrame with duplicated values
data = {'col1': [1, 2, 3, 3, 4, 5, 5], 'col2': ['a', 'b', 'c', 'c', 'd', 'e', 'e']}
df = pd.DataFrame(data)

In [14]:
df

   col1 col2
0     1    a
1     2    b
2     3    c
3     3    c
4     4    d
5     5    e
6     5    e

In [17]:
# identify and print the duplicated rows
duplicates = df[df.duplicated()]

In [18]:
duplicates

   col1 col2
3     3    c
6     5    e

In [15]:
cleaned_df = df.drop_duplicates()

In [16]:
cleaned_df

   col1 col2
0     1    a
1     2    b
2     3    c
4     4    d
5     5    e

In [ ]:
# create example DataFrame with some outliers
data = {'col1': [1, 2, 3, 4, 5, 20], 'col2': [10, 20, 30, 40, 50, 200]}
df = pd.DataFrame(data)



# detect outliers using IQR
Q1 = df.quantile(0.25)
Q3 = df.quantile(0.75)
IQR = Q3 - Q1
outliers = (df < (Q1 - 1.5 * IQR)) | (df > (Q3 + 1.5 * IQR))
print("\nOutliers detected using IQR:")
print(df[outliers.any(axis=1)])

# remove outliers and print cleaned DataFrame
cleaned_df = df[~outliers.any(axis=1)]
print("\nCleaned DataFrame:")

In [19]:
data = {'col1': [1, 2, 3, 4, 5, 20], 'col2': [10, 20, 30, 40, 50, 200]}
df = pd.DataFrame(data)

In [20]:
df

   col1  col2
0     1    10
1     2    20
2     3    30
3     4    40
4     5    50
5    20   200

In [21]:
Q1 = df.quantile(0.25)
Q3 = df.quantile(0.75)
IQR = Q3 - Q1
outliers = (df < (Q1 - 1.5 * IQR)) | (df > (Q3 + 1.5 * IQR))
print("\nOutliers detected using IQR:")
print(df[outliers.any(axis=1)])

Outliers detected using IQR:
   col1  col2
5    20   200

In [23]:
cleaned_df = df[~outliers.any(axis=1)]
print("\nCleaned DataFrame:")
cleaned_df

Cleaned DataFrame:

   col1  col2
0     1    10
1     2    20
2     3    30
3     4    40
4     5    50